---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures
source: html/f1af7139-8dc7-c6de-b703-b01eb95fdff3.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarCouplerFailures

Failures concerning couplers

## Syntax (C#)
```csharp
public static class RebarCouplerFailures
```